{
  "posts": [
    {
      "title": "My Experience with HTML",
      "release": "October 2024",
      "date": "9/19/25",
      "text": "Hyper Text Markup Language, or HTML, is literally the foundation of the internet and the web. It is the backbone of a website and it contains all the content on a web page. It is one of the three foundational languages (along with CSS and JavaScript) that make up a website.<BR>Every website I've ever made, every web page I've ever written, I started with HTML. It's the first language I truly learned and mastered, and it's where all the creativity comes from. It is truly special to me.<BR>Back in the Christmas of 2020, my parents bought me the book that changed me forever. The Wizards of the Programming Island first introduced me to web development, and the first thing it taught me was HTML. I followed its examples, tried it on coding playgrounds, looked up different resources, learned more techniques... and just like that, I got completely hooked up with web development. I started going on amazing websites like W3Schools and Sololearn and so many more, eager to learn more HTML, watched hours of YouTube tutorials on HTML projects, and finally, after nearly 3 years of experimenting, failing, and learning, I mastered HTML. I liked it so much I even used it to make websites for my school projects!<BR>After so many years into web development, I'm still relying on the special language a lot. Looking back on this journey, I'm grateful that my parents bought me that book 🔥.",
      "tag": "skill"
    },
    {
      "title": "My CSS Skills",
      "release": "October 2024",
      "date": "9/19/25",
      "text": "Cascading Style Sheets, or CSS, is the language that styles the looks and layouts of a website. It is one of the three foundational languages (along with HTML and JavaScript) that make up a website.<BR>From setting the most basic background color change to making modern, responsive, and visually appealing websites, my CSS skills have improved a lot. Back then I could only set colors or sizes for different elements, but I now I can build beautiful interactive experiences with CSS along with the help of JavaScript. When I first started web dev, I was only blindly following the tutorials' CSS code, without actually understanding what each line did and how they worked together to create an appealing design. But now, through hours of browsing online web docs/articles/forums/videos, I learned a lot of neat tricks and more advanced concepts about CSS to work around with annoying bugs or challenges and try to incorporate this knowledge into my projects. I really love vanilla CSS and I wouldn't trade it for any CSS framework. It just does whatever you tell it to do without any of the limitations or hassles from these frameworks. My life has also become so much easier after learning about CSS variables that save so much work on toggling between light and dark mode.",
      "tag": "skill"
    },
    {
      "title": "My Journey with JavaScript",
      "release": "October 2024",
      "date": "9/19/25",
      "text": "JavaScript, or JS, is the language that literally runs the internet and make websites dynamic, functional, and usable. It is one of the three foundational languages (along with HTML and CSS) that make up a website.<BR>To be honest, I was pretty scared of learning JavaScript when I first started web developent. I saw these cool apps and the code behind it and I didn't understand one single thing from the unintelligible symbols and letters. But slowly and surely, I made a couple very small projects with minimal JavaScript copied word for word from YouTube tutorials. I also read a bunch of books and used a bunch of JavaScript learning platforms like W3Schools, Sololearn, and Learn JavaScript to learn the basic syntax and understand how the coding language works. Just like this, reading articles, trying to imagine the flow of the program in my head, and understanding how these YouTube tutorial projects work, I learned JavaScript. I became more ambitious and started making my own web apps with JavaScript. It wasn't easy and I kept forgetting simple concepts I learned months ago, but ChatGPT, the savior of all developers, emerged. I still wanted to master JavaScript but didn't want to deal with annoying bugs, so I often asked ChatGPT to fix my code and explain how the changes made my project work. I wasn't just copying code from ChatGPT, but I was also trying to understand how the code worked and why it was written like that. If I saw a new syntax/method in the code I'd never seen before I would ask ChatGPT or search it up, and boom new JS knowledge unlocked.<BR>Now, I'm almost completely comfortable with JavaScript and my scale went from no more than 10 lines to hundreds of lines on multiple files and I've made some pretty impressive apps (at least in my opinion 😏) with it. I'm also no longer using ChatGPT as a code fixer, but a partner that I can discuss different approaches to problems with. I've also picked up a cool thing or two about JS from inspecting code on GitHub, Stack Overflow, or even Reddit. I plan to improve my JS knowledge even more by learning and developing back-end with Node.js, and that way I can unlock the full potential of JS while strengthening my async/promise skill set. JavaScript went from a scary mess to my favorite language (unpopular opinion, I know) and I'm just getting started.",
      "tag": "skill"
    },
    {
      "title": "My Favorite Game: Brawl Stars",
      "release": "4/20/25",
      "date": "9/27/25",
      "text": "Brawl Stars, an online multiplayer battle game made by Supercell, is my favorite mobile game and possibly my favorite game of all time. It has hundreds of millions of players with multiple game modes, brawlers, maps, and strategies to win.<BR> I started playing Brawl Stars in 2020 when a lot of my friends were playing it. Then the game kind of just died and I uninstalled it after only playing for a couple of weeks. In December 2022, I picked it up again because I was bored and had no game on my phone. It was after that when I fell in love with the game and started playing it almost daily for hours, especially on weekends. I love the satisfaction of defeating opponents and winning a game, gaining trophies, collecting resources, unlocking new brawlers and abilities, and progressing my account.<BR> A ton of fixes, improvements, and new features were also added to the game during this period, and they started giving out a ton of free rewards, which made me play even more. It was also starting to gain popularity again and almost all my friends started playing the game. I learned a ton of new strategies on certain maps, brawler combos, maneuvers to hit shots/dodge enemies, and how to use each brawler to their fullest potential. When I first started, I was auto-aiming almost everytime, but now I can hit shots with precision and accuracy. Playing with friends either in Ranked or casual friendly matches is a ton of fun and is a huge reason why I play so often. Following the trophy system rework, I was able to push trophies significantly faster, and I now have almost 60k trophies and get to Legendary in every Ranked season. I also have Lunar fame and every brawler unlocked as a free to play. <BR>In the summer of 2025, I stayed in Taiwan for 2 months, and due to having limited data and not having my own phone, I barely touched the game this entire time and almost decided to quit it at one point. After I came back, started high school, and finally got my own phone, of course I resumed playing Brawl Stars but not as much as before because hoemwork was starting to stack up and I was getting busier with each new assignment. The game was also declining in popularity and many of my friends stopped playing the game. Now, the only time I play it is on the 40 minute bus rides when I'm not doomscrolling on TikTok.",
      "tag": "entertainment"
    },
    {
      "title": "My Coding Journey",
      "release": "11/23/23",
      "date": "11/23/23",
      "text": "The road to my coding skills I have right now, was very rough and hard. I learned coding from scratch (both figurtively and literally) since I was eight, with only a book's help. I didn't even know how to use Google! From there, coding was just a spare hobbit I didn't put much focus on. Until 2021, the pandemic hit hard, and all I could do all day was computer and books. I explored the internet, learned a lot of \"computer\" stuff and got an interest in making websites. My own websites! How exciting is that? I restarted coding and my parents bought me a book that helped me a lot.<BR>Because of that book, I learned the very basics of HTML, CSS, and even JS, and also because of the book, I got introduced to W3Schools, which is a really good site for beginners to learn coding basics. I explored web dev but was very confused at first. The main problem was, when I was exploring stuff, I came to a lot of errors and bugs that I had no idea how to solve. That's very normal, but I had no one to guide me and tell me what's the problem. I tried, but failed. On top of that, I was getting older and school had a lot of homeworks so I gave up on web dev.<BR>Again, because of another book I bought, I restarted coding. Now this time the book was entirely about web development and it had pretty interesting examples and a main project to guide me through the learning process. It taught me all common HTML tags and CSS properties, and it also explained them really well. That book was AMAZING. Because of that book, I had a strong interest in coding, again, and this time, every time I went to the library or a bookstore, I would go straight to the coding section and take as many coding books about web dev as I can. The following year was just like that, I read a lot of books about coding, found lots of online resources, especially YouTube, where people slowly guide you through a project, step by step, and I was felling confident.<BR>Just like that, through websites, YouTube, books, and my brain's help, I made some pretty awesome projects. I connected the pieces of knowledge I already had, and I tried and tried and tried. Until I know how a specific method works or until I learn how to fix the bug. It was hard, but you just gotta try. Keep trying and searching for resources and answers, and you will learn. I built a solid foundation in HTML and CSS, and slowly mastered JavaScript. Later, ChatGPT became a thing, and it helped EVERYTHING. It wasn't perfect, almost every suggestion it gave had errors, but I still learned. And of course, coding became my main part of every day life. A couple months later, I was the one who's teaching somebody else how to code!<BR>When I started coding, I was just a kid who was copying things in a book his mom bought for him to the computer. But now, just a few years later, I made multiple web apps and websites! So what's one lesson I'd learn through my coding career? It was hard, definietly, and you will fail in the process. But never give up, and never be too lazy or afraid to try something new, because you will learn something from it. Try to get as much resources as possible (internet, AI, Google, YouTube...) to help you along the way. You look at other people's work, try to understand and learn from it, and then you think of a solution based on what you know and try it yourself. If it fails, try a new solution, then another, then another! Just try.",
      "tag": "personal"
    }
  ]
}
