{
  "skills": [
    {
      "title": "My Experience with HTML",
      "date": "9/19/25",
      "text": "Hyper Text Markup Language, or HTML, is literally the foundation of the internet and the web. It is the backbone of a website and it contains all the content on a web page. It is one of the three foundational languages (along with CSS and JavaScript) that make up a website.<BR>Every website I've ever made, every web page I've ever written, I started with HTML. It's the first language I truly learned and mastered, and it's where all the creativity comes from. It is truly special to me.<BR>Back in the Christmas of 2020, my parents bought me the book that changed me forever. The Wizards of the Programming Island first introduced me to web development, and the first thing it taught me was HTML. I followed its examples, tried it on coding playgrounds, looked up different resources, learned more techniques... and just like that, I got completely hooked up with web development. I started going on amazing websites like W3Schools and Sololearn and so many more, eager to learn more HTML, watched hours of YouTube tutorials on HTML projects, and finally, after nearly 3 years of experimenting, failing, and learning, I mastered HTML. I liked it so much I even used it to make websites for my school projects!<BR>After so many years into web development, I'm still relying on the special language a lot. Looking back on this journey, I'm grateful that my parents bought me that book 🔥."
    },
    {
      "title": "My CSS Skills",
      "date": "9/19/25",
      "text": "Cascading Style Sheets, or CSS, is the language that styles the looks and layouts of a website. It is one of the three foundational languages (along with HTML and JavaScript) that make up a website.<BR>From setting the most basic background color change to making modern, responsive, and visually appealing websites, my CSS skills have improved a lot. Back then I could only set colors or sizes for different elements, but I now I can build beautiful interactive experiences with CSS along with the help of JavaScript. When I first started web dev, I was only blindly following the tutorials' CSS code, without actually understanding what each line did and how they worked together to create an appealing design. But now, through hours of browsing online web docs/articles/forums/videos, I learned a lot of neat tricks and more advanced concepts about CSS to work around with annoying bugs or challenges and try to incorporate this knowledge into my projects. I really love vanilla CSS and I wouldn't trade it for any CSS framework. It just does whatever you tell it to do without any of the limitations or hassles from these frameworks. My life has also become so much easier after learning about CSS variables that save so much work on toggling between light and dark mode."
    },
    {
      "title": "My Journey with JavaScript",
      "date": "9/19/25",
      "text": "JavaScript, or JS, is the language that literally runs the internet and make websites dynamic, functional, and usable. It is one of the three foundational languages (along with HTML and CSS) that make up a website.<BR>To be honest, I was pretty scared of learning JavaScript when I first started web developent. I saw these cool apps and the code behind it and I didn't understand one single thing from the unintelligible symbols and letters. But slowly and surely, I made a couple very small projects with minimal JavaScript copied word for word from YouTube tutorials. I also read a bunch of books and used a bunch of JavaScript learning platforms like W3Schools, Sololearn, and Learn JavaScript to learn the basic syntax and understand how the coding language works. Just like this, reading articles, trying to imagine the flow of the program in my head, and understanding how these YouTube tutorial projects work, I learned JavaScript. I became more ambitious and started making my own web apps with JavaScript. It wasn't easy and I kept forgetting simple concepts I learned months ago, but ChatGPT, the savior of all developers, emerged. I still wanted to master JavaScript but didn't want to deal with annoying bugs, so I often asked ChatGPT to fix my code and explain how the changes made my project work. I wasn't just copying code from ChatGPT, but I was also trying to understand how the code worked and why it was written like that. If I saw a new syntax/method in the code I'd never seen before I would ask ChatGPT or search it up, and boom new JS knowledge unlocked.<BR>Now, I'm almost completely comfortable with JavaScript and my scale went from no more than 10 lines to hundreds of lines on multiple files and I've made some pretty impressive apps (at least in my opinion 😏) with it. I'm also no longer using ChatGPT as a code fixer, but a partner that I can discuss different approaches to problems with. I've also picked up a cool thing or two about JS from inspecting code on GitHub, Stack Overflow, or even Reddit. I plan to improve my JS knowledge even more by learning and developing back-end with Node.js, and that way I can unlock the full potential of JS while strengthening my async/promise skill set. JavaScript went from a scary mess to my favorite language (unpopular opinion, I know) and I'm just getting started."
    }
  ]
}
